# Proyecto Individual 1- Data 04- Soy Henry

Data Engineering

## Cargamos las librerias

In [41]:
import sqlite3 
print(sqlite3.sqlite_version)
import pandas as pd

3.36.0

## Nos conectamos con la base de datos

In [42]:
conn = sqlite3.connect('PI01henry.db') # base de datos permanente (Vacía)

In [43]:
print(conn) #Imprimimos para observar si todo va bien

<sqlite3.Connection object at 0x7fc9dbe8ec60>

## Creamos el cursor para ejecutar sentencias en SQLite

In [44]:
cursor = conn.cursor()
cursor

# Nuestra estrategia para construir el Warehouse.

- Usar Dataframe de pandas como fuente de datos para cargar en el DB.
- Utilazar to_sql() para consultar y extraer datos de los Dataframe de origen.
- Usar la biblioteca Python SQLite3 para crear las tablas de almacén e insertar datos.

## Creamos nuestras Tablas

#### 1- Productos

In [6]:
# Creamos la tabla

cursor.execute('''CREATE TABLE IF NOT EXISTS productos(id INTEGER PRIMARY KEY, 
                   marca TEXT, 
                   nombre TEXT, 
                   presentacion TEXT, 
                   categoria1 TEXT,
                   categoria2 TEXT,
                   categoria3 TEXT)
''')
conn.commit()

##### Ingestamos el Dataframe productos en la tabla

In [7]:
# Cargamos el CSV en la variable productoDF
productoDF = pd.read_csv('Datasets relevamiento precios/datasets csv/productos.csv')  
productoDF.head(2)

,id,marca,nombre,presentacion,categoria1,categoria2,categoria3
0,1663,LA ANÓNIMA,Radicheta Atada La Anonima 1 Un,1.0 un,0,0,0
1,2288,LA ANÓNIMA,Perejil Atado La Anonima 1 Un,1.0 un,0,0,0

In [8]:
productoDF.dtypes.head()

id              object
marca           object
nombre          object
presentacion    object
categoria1      object
dtype: object

In [9]:
# Volcamos productoDF a la tabla productos de la base de datos

# if_exists{‘fail’, ‘replace’, ‘append’}, default ‘fail’
productoDF.to_sql('productos', con=conn, if_exists='replace')

72038

In [11]:
#### Comprobamos con una query simple si se cargó correctamente los datos a la base de datos
pd.read_sql_query('select * from productos limit 5',con=conn)

,index,id,marca,nombre,presentacion,categoria1,categoria2,categoria3
0,0,1663,LA ANÓNIMA,Radicheta Atada La Anonima 1 Un,1.0 un,0,0,0
1,1,2288,LA ANÓNIMA,Perejil Atado La Anonima 1 Un,1.0 un,0,0,0
2,2,205870,SIN MARCA,Ojo de Bife 1 Kg,1.0 kg,0,0,0
3,3,205894,SIN MARCA,Milanesa de Peceto Novillito 1 Kg,1.0 kg,0,0,0
4,4,205955,SIN MARCA,Chiquizuela Novillito 1 Kg,1.0 kg,0,0,0

#### 2- Sucursal

In [12]:
# Creamos la tabla
cursor.execute('''CREATE TABLE IF NOT EXISTS sucursal(id INTEGER PRIMARY KEY, 
                   comercioId INTEGER, 
                   banderaId INTEGER, 
                   banderaDescripcion TEXT, 
                   comercioRazonSocial TEXT,
                   provincia TEXT,
                   localidad TEXT,
                   direccion TEXT,
                   lat REAL,
                   lng REAL,
                   sucursalNombre TEXT,
                   sucursalTipo TEXT)
''')
conn.commit()

##### Ingestamos el Dataframe sucursal en la tabla

In [14]:
# Cargamos el CSV en la variable sucursalDF
sucursalDF = pd.read_csv('Datasets relevamiento precios/datasets csv/sucursal.csv')  
sucursalDF.head(5)

,id,comercioId,banderaId,banderaDescripcion,comercioRazonSocial,provincia,localidad,direccion,lat,lng,sucursalNombre,sucursalTipo
0,1-1-7,1,1,Super MAMI,Dinosaurio S.A.,AR-X,SALSIPUEDES,E53 1011 None,-31.126667,-64.295250,Super Mami 4,Hipermercado
1,10-1-1,10,1,Hipermercado Carrefour,INC S.A.,AR-B,San Isidro,Bernardo De Irigoyen 2647,-34.491345,-58.589025,San Isidro,Hipermercado
2,10-1-10,10,1,Hipermercado Carrefour,INC S.A.,AR-B,Hurlingham,Av. Vergara 1910,-34.620610,-58.633769,Villa Tesei,Hipermercado
3,10-1-11,10,1,Hipermercado Carrefour,INC S.A.,AR-B,Malvinas Argentinas,Av. Arturo Illia 3770,-34.528883,-58.701631,Malvinas Argentinas,Hipermercado
4,10-1-112,10,1,Hipermercado Carrefour,INC S.A.,AR-A,Salta,20 De Febrero 37,-24.789072,-65.413699,Salta,Hipermercado

In [15]:
sucursalDF.dtypes

id                      object
comercioId               int64
banderaId                int64
banderaDescripcion      object
comercioRazonSocial     object
provincia               object
localidad               object
direccion               object
lat                    float64
lng                    float64
sucursalNombre          object
sucursalTipo            object
dtype: object

In [16]:
# Volcamos productoDF a la tabla sucursalDF de la base de datos

# if_exists{‘fail’, ‘replace’, ‘append’}, default ‘fail’
sucursalDF.to_sql('sucursal', con=conn, if_exists='replace')

2333

In [17]:
#### Comprobamos con una query simple si se cargó correctamente los datos a la base de datos
pd.read_sql_query('select * from sucursal limit 5',con=conn)

,index,id,comercioId,banderaId,banderaDescripcion,comercioRazonSocial,provincia,localidad,direccion,lat,lng,sucursalNombre,sucursalTipo
0,0,1-1-7,1,1,Super MAMI,Dinosaurio S.A.,AR-X,SALSIPUEDES,E53 1011 None,-31.126667,-64.295250,Super Mami 4,Hipermercado
1,1,10-1-1,10,1,Hipermercado Carrefour,INC S.A.,AR-B,San Isidro,Bernardo De Irigoyen 2647,-34.491345,-58.589025,San Isidro,Hipermercado
2,2,10-1-10,10,1,Hipermercado Carrefour,INC S.A.,AR-B,Hurlingham,Av. Vergara 1910,-34.620610,-58.633769,Villa Tesei,Hipermercado
3,3,10-1-11,10,1,Hipermercado Carrefour,INC S.A.,AR-B,Malvinas Argentinas,Av. Arturo Illia 3770,-34.528883,-58.701631,Malvinas Argentinas,Hipermercado
4,4,10-1-112,10,1,Hipermercado Carrefour,INC S.A.,AR-A,Salta,20 De Febrero 37,-24.789072,-65.413699,Salta,Hipermercado

#### 3- Precio

In [18]:
cursor.execute('''CREATE TABLE IF NOT EXISTS precio(precio REAL , 
                   producto_id INTEGER, 
                   sucursal_id INTEGER,
                   FOREIGN KEY (producto_id)
                      REFERENCES producto (id),
                   FOREIGN KEY (sucursal_id)
                      REFERENCES sucursal (id))
''')
conn.commit()

In [19]:
semana20200413 = pd.read_csv('Datasets relevamiento precios/datasets csv/semana20200413.csv')  
semana20200413.head(2)

   precio producto_id sucursal_id
0    29.9        1663     2-1-014
1    29.9        2288     2-1-032

##### Ingestamos el Dataframe semana20200413.csv en la tabla

In [20]:
# if_exists{‘fail’, ‘replace’, ‘append’}, default ‘fail’

semana20200413.to_sql('precio', con=conn, if_exists='replace')

472166

In [21]:
#### Comprobamos con una query simple si se cargó correctamente los datos a la base de datos
pd.read_sql_query('select * from precio limit 2',con=conn)

   index  precio producto_id sucursal_id
0      0    29.9        1663     2-1-014
1      1    29.9        2288     2-1-032

In [22]:
pd.read_sql_query('select count(*) from precio',con=conn)

   count(*)
0    472166

## A partir de acá veremos como se ingesta de manera incremental los demas CSV's de precios

##### Ingestamos (carga Delta) el Dataframe semana20200419.csv en la tabla

In [23]:
semana20200419 = pd.read_csv('Datasets relevamiento precios/datasets csv/semana20200419.csv')  

# if_exists{‘fail’, ‘replace’, ‘append’}, default ‘fail’
semana20200419.to_sql('precio', con=conn, if_exists='append')

458543

In [24]:
pd.read_sql_query('select count(*) from precio',con=conn)

   count(*)
0    930709

##### Ingestamos (carga Delta) el Dataframe semana20200426.csv en la tabla

In [25]:
semana20200426 = pd.read_csv('Datasets relevamiento precios/datasets csv/semana20200426.csv')  

# if_exists{‘fail’, ‘replace’, ‘append’}, default ‘fail’
semana20200426.to_sql('precio', con=conn, if_exists='append')

478909

In [26]:
pd.read_sql_query('select count(*) from precio',con=conn)

   count(*)
0   1409618

##### Ingestamos (carga Delta) el Dataframe semana20200503.csv en la tabla

In [27]:
semana20200503 = pd.read_csv('Datasets relevamiento precios/datasets csv/semana20200503.csv')  

# if_exists{‘fail’, ‘replace’, ‘append’}, default ‘fail’
semana20200503.to_sql('precio', con=conn, if_exists='append')
pd.read_sql_query('select count(*) from precio',con=conn)

   count(*)
0   1807352

##### Ingestamos (carga Delta) el Dataframe semana20200518.csv en la tabla

In [28]:
semana20200518 = pd.read_csv('Datasets relevamiento precios/datasets csv/semana20200518.csv')  

# if_exists{‘fail’, ‘replace’, ‘append’}, default ‘fail’
semana20200518.to_sql('precio', con=conn, if_exists='append')
pd.read_sql_query('select count(*) from precio',con=conn)

   count(*)
0   2222645

In [29]:
# Precio promedio de la sucursal 9-1-688.
pd.read_sql_query('''SELECT AVG(precio),sucursal_id as sucursal
                     FROM precio
	                 LEFT JOIN sucursal suc
	                 ON(sucursal_id = suc.id)
	                 WHERE suc.id = "9-1-688"''',con=conn)

   AVG(precio) sucursal
0   203.804146  9-1-688

In [38]:
# Precios de la sucursal 9-1-688.
pd.read_sql_query('SELECT DISTINCT precio FROM precio WHERE sucursal_id = "9-1-688"',con=conn)

      precio
0     178.00
1     215.00
2     639.00
3    1059.00
4     255.00
..       ...
402    51.00
403   370.00
404   329.99
405   179.99
406   204.99

[407 rows x 1 columns]

In [39]:
cursor.close()
conn.close()

<img src="mision.jpg">